In [1]:
import pandas as pd

In [15]:
df = pd.read_csv("/Users/juanasipriano/Downloads/ingreso_taholah.csv")

taholah_ingreso = df[df["name"] == "Taholah, WA"].copy()

taholah_ingreso

,geoid,name,B19001001,"B19001001, Error",B19001002,"B19001002, Error",B19001003,"B19001003, Error",B19001004,"B19001004, Error",...,B19001013,"B19001013, Error",B19001014,"B19001014, Error",B19001015,"B19001015, Error",B19001016,"B19001016, Error",B19001017,"B19001017, Error"
3,16000US5370175,"Taholah, WA",250,62,22,17,53,41,14,13,...,31,18,3,6,14,12,34,33,0,13

In [17]:
taholah_ingreso["menos_50000"] = (
    taholah_ingreso["B19001002"] +  # < 10,000
    taholah_ingreso["B19001003"] +  # 10,000-14,999
    taholah_ingreso["B19001004"] +  # 15,000-19,999
    taholah_ingreso["B19001005"] +  # 20,000-24,999
    taholah_ingreso["B19001006"] +  # 25,000-29,999
    taholah_ingreso["B19001007"] +  # 30,000-34,999
    taholah_ingreso["B19001008"] +  # 35,000-39,999
    taholah_ingreso["B19001009"] +  # 40,000-44,999
    taholah_ingreso["B19001010"]    # 45,000-49,999
)

taholah_ingreso["de_50000_a_100000"] = (
    taholah_ingreso["B19001011"] +  # 50,000-59,999
    taholah_ingreso["B19001012"] +  # 60,000-74,999
    taholah_ingreso["B19001013"]    # 75,000-99,999
)

taholah_ingreso["de_100000_a_200000"] = (
    taholah_ingreso["B19001014"] +  # 100,000-124,999
    taholah_ingreso["B19001015"] +  # 125,000-149,999
    taholah_ingreso["B19001016"]    # 150,000-199,999
)

taholah_ingreso["mas_200000"] = taholah_ingreso["B19001017"]
taholah_ingreso["Total_Ingresos"] = taholah_ingreso["B19001001"]

taholah_ingreso.head()

,geoid,name,B19001001,"B19001001, Error",B19001002,"B19001002, Error",B19001003,"B19001003, Error",B19001004,"B19001004, Error",...,"B19001015, Error",B19001016,"B19001016, Error",B19001017,"B19001017, Error",menos_50000,de_50000_a_100000,de_100000_a_200000,mas_200000,Total_Ingresos
3,16000US5370175,"Taholah, WA",250,62,22,17,53,41,14,13,...,12,34,33,0,13,133,66,51,0,250

In [19]:
taholah_ingreso["%menos_50000"] = taholah_ingreso["menos_50000"] / taholah_ingreso["Total_Ingresos"] * 100
taholah_ingreso["%de_50000_a_100000"] = taholah_ingreso["de_50000_a_100000"] / taholah_ingreso["Total_Ingresos"] * 100
taholah_ingreso["%de_100000_a_200000"] = taholah_ingreso["de_100000_a_200000"] / taholah_ingreso["Total_Ingresos"] * 100
taholah_ingreso["%mas_200000"] = taholah_ingreso["mas_200000"] / taholah_ingreso["Total_Ingresos"] * 100

In [21]:
taholah_ingreso.to_csv("ingresos_rangos_tableau.csv", index=False)